---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleData.GetNumberOfCircuitRows
source: html/458f766e-e8b2-9f0a-2931-e61ebb6489fb.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.GetNumberOfCircuitRows Method

Gets the number of rows in the circuit table

## Syntax (C#)
```csharp
public int GetNumberOfCircuitRows()
```

## Returns
The number of rows